###################################################################

# Created by write_sdc on Thu Oct 30 17:31:05 2025

###################################################################
set sdc_version 1.5

set_load -pin_load 0.1 [get_ports CNT_valid]
set_load -pin_load 0.1 [get_ports {CNT[6]}]
set_load -pin_load 0.1 [get_ports {CNT[5]}]
set_load -pin_load 0.1 [get_ports {CNT[4]}]
set_load -pin_load 0.1 [get_ports {CNT[3]}]
set_load -pin_load 0.1 [get_ports {CNT[2]}]
set_load -pin_load 0.1 [get_ports {CNT[1]}]
set_load -pin_load 0.1 [get_ports {CNT[0]}]
set_load -pin_load 0.1 [get_ports code_valid]
set_load -pin_load 0.1 [get_ports {HC[4]}]
set_load -pin_load 0.1 [get_ports {HC[3]}]
set_load -pin_load 0.1 [get_ports {HC[2]}]
set_load -pin_load 0.1 [get_ports {HC[1]}]
set_load -pin_load 0.1 [get_ports {HC[0]}]
set_load -pin_load 0.1 [get_ports {M[4]}]
set_load -pin_load 0.1 [get_ports {M[3]}]
set_load -pin_load 0.1 [get_ports {M[2]}]
set_load -pin_load 0.1 [get_ports {M[1]}]
set_load -pin_load 0.1 [get_ports {M[0]}]
set_load -pin_load 0.1 [get_ports test_so]
set_max_fanout 20 [get_ports clk]
set_max_fanout 20 [get_ports reset]
set_max_fanout 20 [get_ports gray_valid]
set_max_fanout 20 [get_ports {gray_data[2]}]
set_max_fanout 20 [get_ports {gray_data[1]}]
set_max_fanout 20 [get_ports {gray_data[0]}]
set_max_fanout 20 [get_ports test_se]
set_max_fanout 20 [get_ports test_si]
create_clock [get_ports clk]  -period 20  -waveform {0 10}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_false_path   -from [get_ports test_se]
set_input_delay -clock clk  5  [get_ports test_se]
set_input_delay -clock clk  5  [get_ports reset]
set_input_delay -clock clk  5  [get_ports gray_valid]
set_input_delay -clock clk  5  [get_ports {gray_data[2]}]
set_input_delay -clock clk  5  [get_ports {gray_data[1]}]
set_input_delay -clock clk  5  [get_ports {gray_data[0]}]
set_input_delay -clock clk  5  [get_ports test_si]
set_output_delay -clock clk  0.5  [get_ports CNT_valid]
set_output_delay -clock clk  0.5  [get_ports {CNT[6]}]
set_output_delay -clock clk  0.5  [get_ports {CNT[5]}]
set_output_delay -clock clk  0.5  [get_ports {CNT[4]}]
set_output_delay -clock clk  0.5  [get_ports {CNT[3]}]
set_output_delay -clock clk  0.5  [get_ports {CNT[2]}]
set_output_delay -clock clk  0.5  [get_ports {CNT[1]}]
set_output_delay -clock clk  0.5  [get_ports {CNT[0]}]
set_output_delay -clock clk  0.5  [get_ports code_valid]
set_output_delay -clock clk  0.5  [get_ports {HC[4]}]
set_output_delay -clock clk  0.5  [get_ports {HC[3]}]
set_output_delay -clock clk  0.5  [get_ports {HC[2]}]
set_output_delay -clock clk  0.5  [get_ports {HC[1]}]
set_output_delay -clock clk  0.5  [get_ports {HC[0]}]
set_output_delay -clock clk  0.5  [get_ports {M[4]}]
set_output_delay -clock clk  0.5  [get_ports {M[3]}]
set_output_delay -clock clk  0.5  [get_ports {M[2]}]
set_output_delay -clock clk  0.5  [get_ports {M[1]}]
set_output_delay -clock clk  0.5  [get_ports {M[0]}]
set_output_delay -clock clk  0.5  [get_ports test_so]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports reset]
set_drive 1  [get_ports gray_valid]
set_drive 1  [get_ports {gray_data[2]}]
set_drive 1  [get_ports {gray_data[1]}]
set_drive 1  [get_ports {gray_data[0]}]
set_drive 1  [get_ports test_se]
set_drive 1  [get_ports test_si]
