###################################################################

# Created by write_sdc on Sun Dec 21 21:54:51 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max slow -max_library slow\
                         -min fast -min_library fast
set_load -pin_load 0.01 [get_ports {expA[11]}]
set_load -pin_load 0.01 [get_ports {expA[10]}]
set_load -pin_load 0.01 [get_ports {expA[9]}]
set_load -pin_load 0.01 [get_ports {expA[8]}]
set_load -pin_load 0.01 [get_ports {expA[7]}]
set_load -pin_load 0.01 [get_ports {expA[6]}]
set_load -pin_load 0.01 [get_ports {expA[5]}]
set_load -pin_load 0.01 [get_ports {expA[4]}]
set_load -pin_load 0.01 [get_ports {expA[3]}]
set_load -pin_load 0.01 [get_ports {expA[2]}]
set_load -pin_load 0.01 [get_ports {expA[1]}]
set_load -pin_load 0.01 [get_ports {expA[0]}]
set_load -pin_load 0.01 [get_ports {expB[11]}]
set_load -pin_load 0.01 [get_ports {expB[10]}]
set_load -pin_load 0.01 [get_ports {expB[9]}]
set_load -pin_load 0.01 [get_ports {expB[8]}]
set_load -pin_load 0.01 [get_ports {expB[7]}]
set_load -pin_load 0.01 [get_ports {expB[6]}]
set_load -pin_load 0.01 [get_ports {expB[5]}]
set_load -pin_load 0.01 [get_ports {expB[4]}]
set_load -pin_load 0.01 [get_ports {expB[3]}]
set_load -pin_load 0.01 [get_ports {expB[2]}]
set_load -pin_load 0.01 [get_ports {expB[1]}]
set_load -pin_load 0.01 [get_ports {expB[0]}]
set_load -pin_load 0.01 [get_ports {expC[11]}]
set_load -pin_load 0.01 [get_ports {expC[10]}]
set_load -pin_load 0.01 [get_ports {expC[9]}]
set_load -pin_load 0.01 [get_ports {expC[8]}]
set_load -pin_load 0.01 [get_ports {expC[7]}]
set_load -pin_load 0.01 [get_ports {expC[6]}]
set_load -pin_load 0.01 [get_ports {expC[5]}]
set_load -pin_load 0.01 [get_ports {expC[4]}]
set_load -pin_load 0.01 [get_ports {expC[3]}]
set_load -pin_load 0.01 [get_ports {expC[2]}]
set_load -pin_load 0.01 [get_ports {expC[1]}]
set_load -pin_load 0.01 [get_ports {expC[0]}]
set_load -pin_load 0.01 [get_ports busy]
set_load -pin_load 0.01 [get_ports out_valid]
set_load -pin_load 0.01 [get_ports {xt[7]}]
set_load -pin_load 0.01 [get_ports {xt[6]}]
set_load -pin_load 0.01 [get_ports {xt[5]}]
set_load -pin_load 0.01 [get_ports {xt[4]}]
set_load -pin_load 0.01 [get_ports {xt[3]}]
set_load -pin_load 0.01 [get_ports {xt[2]}]
set_load -pin_load 0.01 [get_ports {xt[1]}]
set_load -pin_load 0.01 [get_ports {xt[0]}]
set_load -pin_load 0.01 [get_ports {yt[7]}]
set_load -pin_load 0.01 [get_ports {yt[6]}]
set_load -pin_load 0.01 [get_ports {yt[5]}]
set_load -pin_load 0.01 [get_ports {yt[4]}]
set_load -pin_load 0.01 [get_ports {yt[3]}]
set_load -pin_load 0.01 [get_ports {yt[2]}]
set_load -pin_load 0.01 [get_ports {yt[1]}]
set_load -pin_load 0.01 [get_ports {yt[0]}]
set_max_fanout 6 [get_ports clk]
set_max_fanout 6 [get_ports rst]
set_max_fanout 6 [get_ports {A_x[7]}]
set_max_fanout 6 [get_ports {A_x[6]}]
set_max_fanout 6 [get_ports {A_x[5]}]
set_max_fanout 6 [get_ports {A_x[4]}]
set_max_fanout 6 [get_ports {A_x[3]}]
set_max_fanout 6 [get_ports {A_x[2]}]
set_max_fanout 6 [get_ports {A_x[1]}]
set_max_fanout 6 [get_ports {A_x[0]}]
set_max_fanout 6 [get_ports {A_y[7]}]
set_max_fanout 6 [get_ports {A_y[6]}]
set_max_fanout 6 [get_ports {A_y[5]}]
set_max_fanout 6 [get_ports {A_y[4]}]
set_max_fanout 6 [get_ports {A_y[3]}]
set_max_fanout 6 [get_ports {A_y[2]}]
set_max_fanout 6 [get_ports {A_y[1]}]
set_max_fanout 6 [get_ports {A_y[0]}]
set_max_fanout 6 [get_ports {B_x[7]}]
set_max_fanout 6 [get_ports {B_x[6]}]
set_max_fanout 6 [get_ports {B_x[5]}]
set_max_fanout 6 [get_ports {B_x[4]}]
set_max_fanout 6 [get_ports {B_x[3]}]
set_max_fanout 6 [get_ports {B_x[2]}]
set_max_fanout 6 [get_ports {B_x[1]}]
set_max_fanout 6 [get_ports {B_x[0]}]
set_max_fanout 6 [get_ports {B_y[7]}]
set_max_fanout 6 [get_ports {B_y[6]}]
set_max_fanout 6 [get_ports {B_y[5]}]
set_max_fanout 6 [get_ports {B_y[4]}]
set_max_fanout 6 [get_ports {B_y[3]}]
set_max_fanout 6 [get_ports {B_y[2]}]
set_max_fanout 6 [get_ports {B_y[1]}]
set_max_fanout 6 [get_ports {B_y[0]}]
set_max_fanout 6 [get_ports {C_x[7]}]
set_max_fanout 6 [get_ports {C_x[6]}]
set_max_fanout 6 [get_ports {C_x[5]}]
set_max_fanout 6 [get_ports {C_x[4]}]
set_max_fanout 6 [get_ports {C_x[3]}]
set_max_fanout 6 [get_ports {C_x[2]}]
set_max_fanout 6 [get_ports {C_x[1]}]
set_max_fanout 6 [get_ports {C_x[0]}]
set_max_fanout 6 [get_ports {C_y[7]}]
set_max_fanout 6 [get_ports {C_y[6]}]
set_max_fanout 6 [get_ports {C_y[5]}]
set_max_fanout 6 [get_ports {C_y[4]}]
set_max_fanout 6 [get_ports {C_y[3]}]
set_max_fanout 6 [get_ports {C_y[2]}]
set_max_fanout 6 [get_ports {C_y[1]}]
set_max_fanout 6 [get_ports {C_y[0]}]
set_max_fanout 6 [get_ports {rssiA[19]}]
set_max_fanout 6 [get_ports {rssiA[18]}]
set_max_fanout 6 [get_ports {rssiA[17]}]
set_max_fanout 6 [get_ports {rssiA[16]}]
set_max_fanout 6 [get_ports {rssiA[15]}]
set_max_fanout 6 [get_ports {rssiA[14]}]
set_max_fanout 6 [get_ports {rssiA[13]}]
set_max_fanout 6 [get_ports {rssiA[12]}]
set_max_fanout 6 [get_ports {rssiA[11]}]
set_max_fanout 6 [get_ports {rssiA[10]}]
set_max_fanout 6 [get_ports {rssiA[9]}]
set_max_fanout 6 [get_ports {rssiA[8]}]
set_max_fanout 6 [get_ports {rssiA[7]}]
set_max_fanout 6 [get_ports {rssiA[6]}]
set_max_fanout 6 [get_ports {rssiA[5]}]
set_max_fanout 6 [get_ports {rssiA[4]}]
set_max_fanout 6 [get_ports {rssiA[3]}]
set_max_fanout 6 [get_ports {rssiA[2]}]
set_max_fanout 6 [get_ports {rssiA[1]}]
set_max_fanout 6 [get_ports {rssiA[0]}]
set_max_fanout 6 [get_ports {rssiB[19]}]
set_max_fanout 6 [get_ports {rssiB[18]}]
set_max_fanout 6 [get_ports {rssiB[17]}]
set_max_fanout 6 [get_ports {rssiB[16]}]
set_max_fanout 6 [get_ports {rssiB[15]}]
set_max_fanout 6 [get_ports {rssiB[14]}]
set_max_fanout 6 [get_ports {rssiB[13]}]
set_max_fanout 6 [get_ports {rssiB[12]}]
set_max_fanout 6 [get_ports {rssiB[11]}]
set_max_fanout 6 [get_ports {rssiB[10]}]
set_max_fanout 6 [get_ports {rssiB[9]}]
set_max_fanout 6 [get_ports {rssiB[8]}]
set_max_fanout 6 [get_ports {rssiB[7]}]
set_max_fanout 6 [get_ports {rssiB[6]}]
set_max_fanout 6 [get_ports {rssiB[5]}]
set_max_fanout 6 [get_ports {rssiB[4]}]
set_max_fanout 6 [get_ports {rssiB[3]}]
set_max_fanout 6 [get_ports {rssiB[2]}]
set_max_fanout 6 [get_ports {rssiB[1]}]
set_max_fanout 6 [get_ports {rssiB[0]}]
set_max_fanout 6 [get_ports {rssiC[19]}]
set_max_fanout 6 [get_ports {rssiC[18]}]
set_max_fanout 6 [get_ports {rssiC[17]}]
set_max_fanout 6 [get_ports {rssiC[16]}]
set_max_fanout 6 [get_ports {rssiC[15]}]
set_max_fanout 6 [get_ports {rssiC[14]}]
set_max_fanout 6 [get_ports {rssiC[13]}]
set_max_fanout 6 [get_ports {rssiC[12]}]
set_max_fanout 6 [get_ports {rssiC[11]}]
set_max_fanout 6 [get_ports {rssiC[10]}]
set_max_fanout 6 [get_ports {rssiC[9]}]
set_max_fanout 6 [get_ports {rssiC[8]}]
set_max_fanout 6 [get_ports {rssiC[7]}]
set_max_fanout 6 [get_ports {rssiC[6]}]
set_max_fanout 6 [get_ports {rssiC[5]}]
set_max_fanout 6 [get_ports {rssiC[4]}]
set_max_fanout 6 [get_ports {rssiC[3]}]
set_max_fanout 6 [get_ports {rssiC[2]}]
set_max_fanout 6 [get_ports {rssiC[1]}]
set_max_fanout 6 [get_ports {rssiC[0]}]
set_max_fanout 6 [get_ports {valueA[15]}]
set_max_fanout 6 [get_ports {valueA[14]}]
set_max_fanout 6 [get_ports {valueA[13]}]
set_max_fanout 6 [get_ports {valueA[12]}]
set_max_fanout 6 [get_ports {valueA[11]}]
set_max_fanout 6 [get_ports {valueA[10]}]
set_max_fanout 6 [get_ports {valueA[9]}]
set_max_fanout 6 [get_ports {valueA[8]}]
set_max_fanout 6 [get_ports {valueA[7]}]
set_max_fanout 6 [get_ports {valueA[6]}]
set_max_fanout 6 [get_ports {valueA[5]}]
set_max_fanout 6 [get_ports {valueA[4]}]
set_max_fanout 6 [get_ports {valueA[3]}]
set_max_fanout 6 [get_ports {valueA[2]}]
set_max_fanout 6 [get_ports {valueA[1]}]
set_max_fanout 6 [get_ports {valueA[0]}]
set_max_fanout 6 [get_ports {valueB[15]}]
set_max_fanout 6 [get_ports {valueB[14]}]
set_max_fanout 6 [get_ports {valueB[13]}]
set_max_fanout 6 [get_ports {valueB[12]}]
set_max_fanout 6 [get_ports {valueB[11]}]
set_max_fanout 6 [get_ports {valueB[10]}]
set_max_fanout 6 [get_ports {valueB[9]}]
set_max_fanout 6 [get_ports {valueB[8]}]
set_max_fanout 6 [get_ports {valueB[7]}]
set_max_fanout 6 [get_ports {valueB[6]}]
set_max_fanout 6 [get_ports {valueB[5]}]
set_max_fanout 6 [get_ports {valueB[4]}]
set_max_fanout 6 [get_ports {valueB[3]}]
set_max_fanout 6 [get_ports {valueB[2]}]
set_max_fanout 6 [get_ports {valueB[1]}]
set_max_fanout 6 [get_ports {valueB[0]}]
set_max_fanout 6 [get_ports {valueC[15]}]
set_max_fanout 6 [get_ports {valueC[14]}]
set_max_fanout 6 [get_ports {valueC[13]}]
set_max_fanout 6 [get_ports {valueC[12]}]
set_max_fanout 6 [get_ports {valueC[11]}]
set_max_fanout 6 [get_ports {valueC[10]}]
set_max_fanout 6 [get_ports {valueC[9]}]
set_max_fanout 6 [get_ports {valueC[8]}]
set_max_fanout 6 [get_ports {valueC[7]}]
set_max_fanout 6 [get_ports {valueC[6]}]
set_max_fanout 6 [get_ports {valueC[5]}]
set_max_fanout 6 [get_ports {valueC[4]}]
set_max_fanout 6 [get_ports {valueC[3]}]
set_max_fanout 6 [get_ports {valueC[2]}]
set_max_fanout 6 [get_ports {valueC[1]}]
set_max_fanout 6 [get_ports {valueC[0]}]
create_clock [get_ports clk]  -period 4.1  -waveform {0 2.05}
set_clock_latency 1  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_false_path   -from [get_ports test_se]
set_input_delay -clock clk  -max 0.41  [get_ports {valueA[15]}]
set_input_delay -clock clk  -min 0  [get_ports {valueA[15]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueA[14]}]
set_input_delay -clock clk  -min 0  [get_ports {valueA[14]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueA[13]}]
set_input_delay -clock clk  -min 0  [get_ports {valueA[13]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueA[12]}]
set_input_delay -clock clk  -min 0  [get_ports {valueA[12]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueA[11]}]
set_input_delay -clock clk  -min 0  [get_ports {valueA[11]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueA[10]}]
set_input_delay -clock clk  -min 0  [get_ports {valueA[10]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueA[9]}]
set_input_delay -clock clk  -min 0  [get_ports {valueA[9]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueA[8]}]
set_input_delay -clock clk  -min 0  [get_ports {valueA[8]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueA[7]}]
set_input_delay -clock clk  -min 0  [get_ports {valueA[7]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueA[6]}]
set_input_delay -clock clk  -min 0  [get_ports {valueA[6]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueA[5]}]
set_input_delay -clock clk  -min 0  [get_ports {valueA[5]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueA[4]}]
set_input_delay -clock clk  -min 0  [get_ports {valueA[4]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueA[3]}]
set_input_delay -clock clk  -min 0  [get_ports {valueA[3]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueA[2]}]
set_input_delay -clock clk  -min 0  [get_ports {valueA[2]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueA[1]}]
set_input_delay -clock clk  -min 0  [get_ports {valueA[1]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueA[0]}]
set_input_delay -clock clk  -min 0  [get_ports {valueA[0]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueB[15]}]
set_input_delay -clock clk  -min 0  [get_ports {valueB[15]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueB[14]}]
set_input_delay -clock clk  -min 0  [get_ports {valueB[14]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueB[13]}]
set_input_delay -clock clk  -min 0  [get_ports {valueB[13]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueB[12]}]
set_input_delay -clock clk  -min 0  [get_ports {valueB[12]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueB[11]}]
set_input_delay -clock clk  -min 0  [get_ports {valueB[11]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueB[10]}]
set_input_delay -clock clk  -min 0  [get_ports {valueB[10]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueB[9]}]
set_input_delay -clock clk  -min 0  [get_ports {valueB[9]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueB[8]}]
set_input_delay -clock clk  -min 0  [get_ports {valueB[8]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueB[7]}]
set_input_delay -clock clk  -min 0  [get_ports {valueB[7]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueB[6]}]
set_input_delay -clock clk  -min 0  [get_ports {valueB[6]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueB[5]}]
set_input_delay -clock clk  -min 0  [get_ports {valueB[5]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueB[4]}]
set_input_delay -clock clk  -min 0  [get_ports {valueB[4]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueB[3]}]
set_input_delay -clock clk  -min 0  [get_ports {valueB[3]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueB[2]}]
set_input_delay -clock clk  -min 0  [get_ports {valueB[2]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueB[1]}]
set_input_delay -clock clk  -min 0  [get_ports {valueB[1]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueB[0]}]
set_input_delay -clock clk  -min 0  [get_ports {valueB[0]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueC[15]}]
set_input_delay -clock clk  -min 0  [get_ports {valueC[15]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueC[14]}]
set_input_delay -clock clk  -min 0  [get_ports {valueC[14]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueC[13]}]
set_input_delay -clock clk  -min 0  [get_ports {valueC[13]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueC[12]}]
set_input_delay -clock clk  -min 0  [get_ports {valueC[12]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueC[11]}]
set_input_delay -clock clk  -min 0  [get_ports {valueC[11]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueC[10]}]
set_input_delay -clock clk  -min 0  [get_ports {valueC[10]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueC[9]}]
set_input_delay -clock clk  -min 0  [get_ports {valueC[9]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueC[8]}]
set_input_delay -clock clk  -min 0  [get_ports {valueC[8]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueC[7]}]
set_input_delay -clock clk  -min 0  [get_ports {valueC[7]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueC[6]}]
set_input_delay -clock clk  -min 0  [get_ports {valueC[6]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueC[5]}]
set_input_delay -clock clk  -min 0  [get_ports {valueC[5]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueC[4]}]
set_input_delay -clock clk  -min 0  [get_ports {valueC[4]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueC[3]}]
set_input_delay -clock clk  -min 0  [get_ports {valueC[3]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueC[2]}]
set_input_delay -clock clk  -min 0  [get_ports {valueC[2]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueC[1]}]
set_input_delay -clock clk  -min 0  [get_ports {valueC[1]}]
set_input_delay -clock clk  -max 0.41  [get_ports {valueC[0]}]
set_input_delay -clock clk  -min 0  [get_ports {valueC[0]}]
set_input_delay -clock clk  -max 0.41  [get_ports rst]
set_input_delay -clock clk  -min 0  [get_ports rst]
set_input_delay -clock clk  -max 0.41  [get_ports {A_x[7]}]
set_input_delay -clock clk  -min 0  [get_ports {A_x[7]}]
set_input_delay -clock clk  -max 0.41  [get_ports {A_x[6]}]
set_input_delay -clock clk  -min 0  [get_ports {A_x[6]}]
set_input_delay -clock clk  -max 0.41  [get_ports {A_x[5]}]
set_input_delay -clock clk  -min 0  [get_ports {A_x[5]}]
set_input_delay -clock clk  -max 0.41  [get_ports {A_x[4]}]
set_input_delay -clock clk  -min 0  [get_ports {A_x[4]}]
set_input_delay -clock clk  -max 0.41  [get_ports {A_x[3]}]
set_input_delay -clock clk  -min 0  [get_ports {A_x[3]}]
set_input_delay -clock clk  -max 0.41  [get_ports {A_x[2]}]
set_input_delay -clock clk  -min 0  [get_ports {A_x[2]}]
set_input_delay -clock clk  -max 0.41  [get_ports {A_x[1]}]
set_input_delay -clock clk  -min 0  [get_ports {A_x[1]}]
set_input_delay -clock clk  -max 0.41  [get_ports {A_x[0]}]
set_input_delay -clock clk  -min 0  [get_ports {A_x[0]}]
set_input_delay -clock clk  -max 0.41  [get_ports {A_y[7]}]
set_input_delay -clock clk  -min 0  [get_ports {A_y[7]}]
set_input_delay -clock clk  -max 0.41  [get_ports {A_y[6]}]
set_input_delay -clock clk  -min 0  [get_ports {A_y[6]}]
set_input_delay -clock clk  -max 0.41  [get_ports {A_y[5]}]
set_input_delay -clock clk  -min 0  [get_ports {A_y[5]}]
set_input_delay -clock clk  -max 0.41  [get_ports {A_y[4]}]
set_input_delay -clock clk  -min 0  [get_ports {A_y[4]}]
set_input_delay -clock clk  -max 0.41  [get_ports {A_y[3]}]
set_input_delay -clock clk  -min 0  [get_ports {A_y[3]}]
set_input_delay -clock clk  -max 0.41  [get_ports {A_y[2]}]
set_input_delay -clock clk  -min 0  [get_ports {A_y[2]}]
set_input_delay -clock clk  -max 0.41  [get_ports {A_y[1]}]
set_input_delay -clock clk  -min 0  [get_ports {A_y[1]}]
set_input_delay -clock clk  -max 0.41  [get_ports {A_y[0]}]
set_input_delay -clock clk  -min 0  [get_ports {A_y[0]}]
set_input_delay -clock clk  -max 0.41  [get_ports {B_x[7]}]
set_input_delay -clock clk  -min 0  [get_ports {B_x[7]}]
set_input_delay -clock clk  -max 0.41  [get_ports {B_x[6]}]
set_input_delay -clock clk  -min 0  [get_ports {B_x[6]}]
set_input_delay -clock clk  -max 0.41  [get_ports {B_x[5]}]
set_input_delay -clock clk  -min 0  [get_ports {B_x[5]}]
set_input_delay -clock clk  -max 0.41  [get_ports {B_x[4]}]
set_input_delay -clock clk  -min 0  [get_ports {B_x[4]}]
set_input_delay -clock clk  -max 0.41  [get_ports {B_x[3]}]
set_input_delay -clock clk  -min 0  [get_ports {B_x[3]}]
set_input_delay -clock clk  -max 0.41  [get_ports {B_x[2]}]
set_input_delay -clock clk  -min 0  [get_ports {B_x[2]}]
set_input_delay -clock clk  -max 0.41  [get_ports {B_x[1]}]
set_input_delay -clock clk  -min 0  [get_ports {B_x[1]}]
set_input_delay -clock clk  -max 0.41  [get_ports {B_x[0]}]
set_input_delay -clock clk  -min 0  [get_ports {B_x[0]}]
set_input_delay -clock clk  -max 0.41  [get_ports {B_y[7]}]
set_input_delay -clock clk  -min 0  [get_ports {B_y[7]}]
set_input_delay -clock clk  -max 0.41  [get_ports {B_y[6]}]
set_input_delay -clock clk  -min 0  [get_ports {B_y[6]}]
set_input_delay -clock clk  -max 0.41  [get_ports {B_y[5]}]
set_input_delay -clock clk  -min 0  [get_ports {B_y[5]}]
set_input_delay -clock clk  -max 0.41  [get_ports {B_y[4]}]
set_input_delay -clock clk  -min 0  [get_ports {B_y[4]}]
set_input_delay -clock clk  -max 0.41  [get_ports {B_y[3]}]
set_input_delay -clock clk  -min 0  [get_ports {B_y[3]}]
set_input_delay -clock clk  -max 0.41  [get_ports {B_y[2]}]
set_input_delay -clock clk  -min 0  [get_ports {B_y[2]}]
set_input_delay -clock clk  -max 0.41  [get_ports {B_y[1]}]
set_input_delay -clock clk  -min 0  [get_ports {B_y[1]}]
set_input_delay -clock clk  -max 0.41  [get_ports {B_y[0]}]
set_input_delay -clock clk  -min 0  [get_ports {B_y[0]}]
set_input_delay -clock clk  -max 0.41  [get_ports {C_x[7]}]
set_input_delay -clock clk  -min 0  [get_ports {C_x[7]}]
set_input_delay -clock clk  -max 0.41  [get_ports {C_x[6]}]
set_input_delay -clock clk  -min 0  [get_ports {C_x[6]}]
set_input_delay -clock clk  -max 0.41  [get_ports {C_x[5]}]
set_input_delay -clock clk  -min 0  [get_ports {C_x[5]}]
set_input_delay -clock clk  -max 0.41  [get_ports {C_x[4]}]
set_input_delay -clock clk  -min 0  [get_ports {C_x[4]}]
set_input_delay -clock clk  -max 0.41  [get_ports {C_x[3]}]
set_input_delay -clock clk  -min 0  [get_ports {C_x[3]}]
set_input_delay -clock clk  -max 0.41  [get_ports {C_x[2]}]
set_input_delay -clock clk  -min 0  [get_ports {C_x[2]}]
set_input_delay -clock clk  -max 0.41  [get_ports {C_x[1]}]
set_input_delay -clock clk  -min 0  [get_ports {C_x[1]}]
set_input_delay -clock clk  -max 0.41  [get_ports {C_x[0]}]
set_input_delay -clock clk  -min 0  [get_ports {C_x[0]}]
set_input_delay -clock clk  -max 0.41  [get_ports {C_y[7]}]
set_input_delay -clock clk  -min 0  [get_ports {C_y[7]}]
set_input_delay -clock clk  -max 0.41  [get_ports {C_y[6]}]
set_input_delay -clock clk  -min 0  [get_ports {C_y[6]}]
set_input_delay -clock clk  -max 0.41  [get_ports {C_y[5]}]
set_input_delay -clock clk  -min 0  [get_ports {C_y[5]}]
set_input_delay -clock clk  -max 0.41  [get_ports {C_y[4]}]
set_input_delay -clock clk  -min 0  [get_ports {C_y[4]}]
set_input_delay -clock clk  -max 0.41  [get_ports {C_y[3]}]
set_input_delay -clock clk  -min 0  [get_ports {C_y[3]}]
set_input_delay -clock clk  -max 0.41  [get_ports {C_y[2]}]
set_input_delay -clock clk  -min 0  [get_ports {C_y[2]}]
set_input_delay -clock clk  -max 0.41  [get_ports {C_y[1]}]
set_input_delay -clock clk  -min 0  [get_ports {C_y[1]}]
set_input_delay -clock clk  -max 0.41  [get_ports {C_y[0]}]
set_input_delay -clock clk  -min 0  [get_ports {C_y[0]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[19]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[19]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[18]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[18]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[17]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[17]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[16]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[16]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[15]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[15]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[14]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[14]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[13]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[13]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[12]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[12]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[11]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[11]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[10]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[10]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[9]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[9]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[8]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[8]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[7]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[7]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[6]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[6]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[5]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[5]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[4]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[4]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[3]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[3]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[2]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[2]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[1]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[1]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiA[0]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiA[0]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[19]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[19]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[18]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[18]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[17]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[17]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[16]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[16]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[15]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[15]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[14]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[14]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[13]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[13]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[12]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[12]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[11]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[11]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[10]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[10]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[9]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[9]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[8]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[8]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[7]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[7]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[6]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[6]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[5]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[5]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[4]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[4]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[3]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[3]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[2]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[2]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[1]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[1]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiB[0]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiB[0]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[19]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[19]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[18]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[18]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[17]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[17]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[16]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[16]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[15]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[15]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[14]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[14]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[13]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[13]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[12]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[12]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[11]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[11]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[10]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[10]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[9]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[9]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[8]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[8]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[7]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[7]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[6]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[6]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[5]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[5]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[4]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[4]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[3]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[3]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[2]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[2]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[1]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[1]}]
set_input_delay -clock clk  -max 0.41  [get_ports {rssiC[0]}]
set_input_delay -clock clk  -min 0  [get_ports {rssiC[0]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expA[11]}]
set_output_delay -clock clk  -min 0  [get_ports {expA[11]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expA[10]}]
set_output_delay -clock clk  -min 0  [get_ports {expA[10]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expA[9]}]
set_output_delay -clock clk  -min 0  [get_ports {expA[9]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expA[8]}]
set_output_delay -clock clk  -min 0  [get_ports {expA[8]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expA[7]}]
set_output_delay -clock clk  -min 0  [get_ports {expA[7]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expA[6]}]
set_output_delay -clock clk  -min 0  [get_ports {expA[6]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expA[5]}]
set_output_delay -clock clk  -min 0  [get_ports {expA[5]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expA[4]}]
set_output_delay -clock clk  -min 0  [get_ports {expA[4]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expA[3]}]
set_output_delay -clock clk  -min 0  [get_ports {expA[3]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expA[2]}]
set_output_delay -clock clk  -min 0  [get_ports {expA[2]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expA[1]}]
set_output_delay -clock clk  -min 0  [get_ports {expA[1]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expA[0]}]
set_output_delay -clock clk  -min 0  [get_ports {expA[0]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expB[11]}]
set_output_delay -clock clk  -min 0  [get_ports {expB[11]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expB[10]}]
set_output_delay -clock clk  -min 0  [get_ports {expB[10]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expB[9]}]
set_output_delay -clock clk  -min 0  [get_ports {expB[9]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expB[8]}]
set_output_delay -clock clk  -min 0  [get_ports {expB[8]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expB[7]}]
set_output_delay -clock clk  -min 0  [get_ports {expB[7]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expB[6]}]
set_output_delay -clock clk  -min 0  [get_ports {expB[6]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expB[5]}]
set_output_delay -clock clk  -min 0  [get_ports {expB[5]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expB[4]}]
set_output_delay -clock clk  -min 0  [get_ports {expB[4]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expB[3]}]
set_output_delay -clock clk  -min 0  [get_ports {expB[3]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expB[2]}]
set_output_delay -clock clk  -min 0  [get_ports {expB[2]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expB[1]}]
set_output_delay -clock clk  -min 0  [get_ports {expB[1]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expB[0]}]
set_output_delay -clock clk  -min 0  [get_ports {expB[0]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expC[11]}]
set_output_delay -clock clk  -min 0  [get_ports {expC[11]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expC[10]}]
set_output_delay -clock clk  -min 0  [get_ports {expC[10]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expC[9]}]
set_output_delay -clock clk  -min 0  [get_ports {expC[9]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expC[8]}]
set_output_delay -clock clk  -min 0  [get_ports {expC[8]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expC[7]}]
set_output_delay -clock clk  -min 0  [get_ports {expC[7]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expC[6]}]
set_output_delay -clock clk  -min 0  [get_ports {expC[6]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expC[5]}]
set_output_delay -clock clk  -min 0  [get_ports {expC[5]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expC[4]}]
set_output_delay -clock clk  -min 0  [get_ports {expC[4]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expC[3]}]
set_output_delay -clock clk  -min 0  [get_ports {expC[3]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expC[2]}]
set_output_delay -clock clk  -min 0  [get_ports {expC[2]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expC[1]}]
set_output_delay -clock clk  -min 0  [get_ports {expC[1]}]
set_output_delay -clock clk  -max 0.41  [get_ports {expC[0]}]
set_output_delay -clock clk  -min 0  [get_ports {expC[0]}]
set_output_delay -clock clk  -max 0.41  [get_ports busy]
set_output_delay -clock clk  -min 0  [get_ports busy]
set_output_delay -clock clk  -max 0.41  [get_ports out_valid]
set_output_delay -clock clk  -min 0  [get_ports out_valid]
set_output_delay -clock clk  -max 0.41  [get_ports {xt[7]}]
set_output_delay -clock clk  -min 0  [get_ports {xt[7]}]
set_output_delay -clock clk  -max 0.41  [get_ports {xt[6]}]
set_output_delay -clock clk  -min 0  [get_ports {xt[6]}]
set_output_delay -clock clk  -max 0.41  [get_ports {xt[5]}]
set_output_delay -clock clk  -min 0  [get_ports {xt[5]}]
set_output_delay -clock clk  -max 0.41  [get_ports {xt[4]}]
set_output_delay -clock clk  -min 0  [get_ports {xt[4]}]
set_output_delay -clock clk  -max 0.41  [get_ports {xt[3]}]
set_output_delay -clock clk  -min 0  [get_ports {xt[3]}]
set_output_delay -clock clk  -max 0.41  [get_ports {xt[2]}]
set_output_delay -clock clk  -min 0  [get_ports {xt[2]}]
set_output_delay -clock clk  -max 0.41  [get_ports {xt[1]}]
set_output_delay -clock clk  -min 0  [get_ports {xt[1]}]
set_output_delay -clock clk  -max 0.41  [get_ports {xt[0]}]
set_output_delay -clock clk  -min 0  [get_ports {xt[0]}]
set_output_delay -clock clk  -max 0.41  [get_ports {yt[7]}]
set_output_delay -clock clk  -min 0  [get_ports {yt[7]}]
set_output_delay -clock clk  -max 0.41  [get_ports {yt[6]}]
set_output_delay -clock clk  -min 0  [get_ports {yt[6]}]
set_output_delay -clock clk  -max 0.41  [get_ports {yt[5]}]
set_output_delay -clock clk  -min 0  [get_ports {yt[5]}]
set_output_delay -clock clk  -max 0.41  [get_ports {yt[4]}]
set_output_delay -clock clk  -min 0  [get_ports {yt[4]}]
set_output_delay -clock clk  -max 0.41  [get_ports {yt[3]}]
set_output_delay -clock clk  -min 0  [get_ports {yt[3]}]
set_output_delay -clock clk  -max 0.41  [get_ports {yt[2]}]
set_output_delay -clock clk  -min 0  [get_ports {yt[2]}]
set_output_delay -clock clk  -max 0.41  [get_ports {yt[1]}]
set_output_delay -clock clk  -min 0  [get_ports {yt[1]}]
set_output_delay -clock clk  -max 0.41  [get_ports {yt[0]}]
set_output_delay -clock clk  -min 0  [get_ports {yt[0]}]
set_drive 0.1  [get_ports clk]
set_drive 0.1  [get_ports rst]
set_drive 0.1  [get_ports {A_x[7]}]
set_drive 0.1  [get_ports {A_x[6]}]
set_drive 0.1  [get_ports {A_x[5]}]
set_drive 0.1  [get_ports {A_x[4]}]
set_drive 0.1  [get_ports {A_x[3]}]
set_drive 0.1  [get_ports {A_x[2]}]
set_drive 0.1  [get_ports {A_x[1]}]
set_drive 0.1  [get_ports {A_x[0]}]
set_drive 0.1  [get_ports {A_y[7]}]
set_drive 0.1  [get_ports {A_y[6]}]
set_drive 0.1  [get_ports {A_y[5]}]
set_drive 0.1  [get_ports {A_y[4]}]
set_drive 0.1  [get_ports {A_y[3]}]
set_drive 0.1  [get_ports {A_y[2]}]
set_drive 0.1  [get_ports {A_y[1]}]
set_drive 0.1  [get_ports {A_y[0]}]
set_drive 0.1  [get_ports {B_x[7]}]
set_drive 0.1  [get_ports {B_x[6]}]
set_drive 0.1  [get_ports {B_x[5]}]
set_drive 0.1  [get_ports {B_x[4]}]
set_drive 0.1  [get_ports {B_x[3]}]
set_drive 0.1  [get_ports {B_x[2]}]
set_drive 0.1  [get_ports {B_x[1]}]
set_drive 0.1  [get_ports {B_x[0]}]
set_drive 0.1  [get_ports {B_y[7]}]
set_drive 0.1  [get_ports {B_y[6]}]
set_drive 0.1  [get_ports {B_y[5]}]
set_drive 0.1  [get_ports {B_y[4]}]
set_drive 0.1  [get_ports {B_y[3]}]
set_drive 0.1  [get_ports {B_y[2]}]
set_drive 0.1  [get_ports {B_y[1]}]
set_drive 0.1  [get_ports {B_y[0]}]
set_drive 0.1  [get_ports {C_x[7]}]
set_drive 0.1  [get_ports {C_x[6]}]
set_drive 0.1  [get_ports {C_x[5]}]
set_drive 0.1  [get_ports {C_x[4]}]
set_drive 0.1  [get_ports {C_x[3]}]
set_drive 0.1  [get_ports {C_x[2]}]
set_drive 0.1  [get_ports {C_x[1]}]
set_drive 0.1  [get_ports {C_x[0]}]
set_drive 0.1  [get_ports {C_y[7]}]
set_drive 0.1  [get_ports {C_y[6]}]
set_drive 0.1  [get_ports {C_y[5]}]
set_drive 0.1  [get_ports {C_y[4]}]
set_drive 0.1  [get_ports {C_y[3]}]
set_drive 0.1  [get_ports {C_y[2]}]
set_drive 0.1  [get_ports {C_y[1]}]
set_drive 0.1  [get_ports {C_y[0]}]
set_drive 0.1  [get_ports {rssiA[19]}]
set_drive 0.1  [get_ports {rssiA[18]}]
set_drive 0.1  [get_ports {rssiA[17]}]
set_drive 0.1  [get_ports {rssiA[16]}]
set_drive 0.1  [get_ports {rssiA[15]}]
set_drive 0.1  [get_ports {rssiA[14]}]
set_drive 0.1  [get_ports {rssiA[13]}]
set_drive 0.1  [get_ports {rssiA[12]}]
set_drive 0.1  [get_ports {rssiA[11]}]
set_drive 0.1  [get_ports {rssiA[10]}]
set_drive 0.1  [get_ports {rssiA[9]}]
set_drive 0.1  [get_ports {rssiA[8]}]
set_drive 0.1  [get_ports {rssiA[7]}]
set_drive 0.1  [get_ports {rssiA[6]}]
set_drive 0.1  [get_ports {rssiA[5]}]
set_drive 0.1  [get_ports {rssiA[4]}]
set_drive 0.1  [get_ports {rssiA[3]}]
set_drive 0.1  [get_ports {rssiA[2]}]
set_drive 0.1  [get_ports {rssiA[1]}]
set_drive 0.1  [get_ports {rssiA[0]}]
set_drive 0.1  [get_ports {rssiB[19]}]
set_drive 0.1  [get_ports {rssiB[18]}]
set_drive 0.1  [get_ports {rssiB[17]}]
set_drive 0.1  [get_ports {rssiB[16]}]
set_drive 0.1  [get_ports {rssiB[15]}]
set_drive 0.1  [get_ports {rssiB[14]}]
set_drive 0.1  [get_ports {rssiB[13]}]
set_drive 0.1  [get_ports {rssiB[12]}]
set_drive 0.1  [get_ports {rssiB[11]}]
set_drive 0.1  [get_ports {rssiB[10]}]
set_drive 0.1  [get_ports {rssiB[9]}]
set_drive 0.1  [get_ports {rssiB[8]}]
set_drive 0.1  [get_ports {rssiB[7]}]
set_drive 0.1  [get_ports {rssiB[6]}]
set_drive 0.1  [get_ports {rssiB[5]}]
set_drive 0.1  [get_ports {rssiB[4]}]
set_drive 0.1  [get_ports {rssiB[3]}]
set_drive 0.1  [get_ports {rssiB[2]}]
set_drive 0.1  [get_ports {rssiB[1]}]
set_drive 0.1  [get_ports {rssiB[0]}]
set_drive 0.1  [get_ports {rssiC[19]}]
set_drive 0.1  [get_ports {rssiC[18]}]
set_drive 0.1  [get_ports {rssiC[17]}]
set_drive 0.1  [get_ports {rssiC[16]}]
set_drive 0.1  [get_ports {rssiC[15]}]
set_drive 0.1  [get_ports {rssiC[14]}]
set_drive 0.1  [get_ports {rssiC[13]}]
set_drive 0.1  [get_ports {rssiC[12]}]
set_drive 0.1  [get_ports {rssiC[11]}]
set_drive 0.1  [get_ports {rssiC[10]}]
set_drive 0.1  [get_ports {rssiC[9]}]
set_drive 0.1  [get_ports {rssiC[8]}]
set_drive 0.1  [get_ports {rssiC[7]}]
set_drive 0.1  [get_ports {rssiC[6]}]
set_drive 0.1  [get_ports {rssiC[5]}]
set_drive 0.1  [get_ports {rssiC[4]}]
set_drive 0.1  [get_ports {rssiC[3]}]
set_drive 0.1  [get_ports {rssiC[2]}]
set_drive 0.1  [get_ports {rssiC[1]}]
set_drive 0.1  [get_ports {rssiC[0]}]
set_drive 0.1  [get_ports {valueA[15]}]
set_drive 0.1  [get_ports {valueA[14]}]
set_drive 0.1  [get_ports {valueA[13]}]
set_drive 0.1  [get_ports {valueA[12]}]
set_drive 0.1  [get_ports {valueA[11]}]
set_drive 0.1  [get_ports {valueA[10]}]
set_drive 0.1  [get_ports {valueA[9]}]
set_drive 0.1  [get_ports {valueA[8]}]
set_drive 0.1  [get_ports {valueA[7]}]
set_drive 0.1  [get_ports {valueA[6]}]
set_drive 0.1  [get_ports {valueA[5]}]
set_drive 0.1  [get_ports {valueA[4]}]
set_drive 0.1  [get_ports {valueA[3]}]
set_drive 0.1  [get_ports {valueA[2]}]
set_drive 0.1  [get_ports {valueA[1]}]
set_drive 0.1  [get_ports {valueA[0]}]
set_drive 0.1  [get_ports {valueB[15]}]
set_drive 0.1  [get_ports {valueB[14]}]
set_drive 0.1  [get_ports {valueB[13]}]
set_drive 0.1  [get_ports {valueB[12]}]
set_drive 0.1  [get_ports {valueB[11]}]
set_drive 0.1  [get_ports {valueB[10]}]
set_drive 0.1  [get_ports {valueB[9]}]
set_drive 0.1  [get_ports {valueB[8]}]
set_drive 0.1  [get_ports {valueB[7]}]
set_drive 0.1  [get_ports {valueB[6]}]
set_drive 0.1  [get_ports {valueB[5]}]
set_drive 0.1  [get_ports {valueB[4]}]
set_drive 0.1  [get_ports {valueB[3]}]
set_drive 0.1  [get_ports {valueB[2]}]
set_drive 0.1  [get_ports {valueB[1]}]
set_drive 0.1  [get_ports {valueB[0]}]
set_drive 0.1  [get_ports {valueC[15]}]
set_drive 0.1  [get_ports {valueC[14]}]
set_drive 0.1  [get_ports {valueC[13]}]
set_drive 0.1  [get_ports {valueC[12]}]
set_drive 0.1  [get_ports {valueC[11]}]
set_drive 0.1  [get_ports {valueC[10]}]
set_drive 0.1  [get_ports {valueC[9]}]
set_drive 0.1  [get_ports {valueC[8]}]
set_drive 0.1  [get_ports {valueC[7]}]
set_drive 0.1  [get_ports {valueC[6]}]
set_drive 0.1  [get_ports {valueC[5]}]
set_drive 0.1  [get_ports {valueC[4]}]
set_drive 0.1  [get_ports {valueC[3]}]
set_drive 0.1  [get_ports {valueC[2]}]
set_drive 0.1  [get_ports {valueC[1]}]
set_drive 0.1  [get_ports {valueC[0]}]
