# ============================================================================
# 變量設置
# ============================================================================
#set CONSTRAIN 9
set TOPLEVEL RFILE
set HDL_DIR RTL
set RPT_DIR report
set DFT_RPT_DIR dft_report
set DFT_NET_DIR netlist
set TECH TSMC13_5
set SCAN scan_chain
# ============================================================================
# 目錄設置與清理
# ============================================================================
sh mkdir -p ./$VERSION/$SCAN/$TECH/clk_$CONSTRAIN
sh rm -rf ./$VERSION/$SCAN/$TECH/clk_$CONSTRAIN/$RPT_DIR
sh rm -rf ./$VERSION/$SCAN/$TECH/clk_$CONSTRAIN/$DFT_NET_DIR
sh rm -rf ./$VERSION/$SCAN/$TECH/clk_$CONSTRAIN/$DFT_RPT_DIR
sh mkdir  ./$VERSION/$SCAN/$TECH/clk_$CONSTRAIN/$RPT_DIR
sh mkdir  ./$VERSION/$SCAN/$TECH/clk_$CONSTRAIN/$DFT_NET_DIR
sh mkdir  ./$VERSION/$SCAN/$TECH/clk_$CONSTRAIN/$DFT_RPT_DIR

# ============================================================================
# 主機選項設置
# ============================================================================
set_host_options -max_cores 4

# ============================================================================
# 設計清理
# ============================================================================
remove_design -designs


# ============================================================================
# SVF 文件設置
# ============================================================================
#set_svf ./$VERSION/$SCAN/$TECH/clk_$CONSTRAIN/$DFT_NET_DIR/${TOPLEVEL}.svf

# ============================================================================
# 讀取設計文件
# ============================================================================

read_file -format verilog ../$HDL_DIR/RFILE_${VERSION}.v

# ============================================================================
# 鏈接設計
# ============================================================================
current_design $TOPLEVEL
link

# ============================================================================
# 讀取時序約束
# ============================================================================
source -echo -verbose ./RFILE_APR.sdc